/*****************************************************************//**
 * \file   SoundManager.h
 * \brief  サウンド管理クラス
 * 
 * \author 深沢拓矢
 * \date   May 2026
 *********************************************************************/

#pragma once

/**
 * @brief サウンド管理クラス
 */
class  SoundManager {

	// クラス定数の宣言 -------------------------------------------------
public:

	// データメンバの宣言 -----------------------------------------------
private:



	// メンバ関数の宣言 -------------------------------------------------
	// コンストラクタ/デストラクタ
public:

	// コンストラクタ
	SoundManager() = default;

	// デストラクタ
	~SoundManager() = default;

	// 操作
public:

	// 取得/設定
public:

	// 内部実装
private:

};
