// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include "Game/State/StateMachine.h"
// クラスの前方宣言 ===================================================
class Player;

// 列挙体の宣言 ===================================================

enum PlayerMoveState
{
	None,
	Idel,
	Move,
	Jump,
};



// クラスの定義 ===============================================================
/**
 * @brief プレイヤーのステートマシン
 */
class  PlayerStateMachine : public StateMachine<Player>{

	// クラス定数の宣言 -------------------------------------------------
public:

	// データメンバの宣言 -----------------------------------------------
private:



	// メンバ関数の宣言 -------------------------------------------------
	// コンストラクタ/デストラクタ
public:

	// コンストラクタ
	PlayerStateMachine() = default;

	// デストラクタ
	~PlayerStateMachine() = default;

	// 操作
public:

	// 取得/設定
public:

	// 内部実装
private:

};
