/*****************************************************************//**
 * \file   PlayerMoveState.h
 * \brief  プレイヤー移動ステートに関するヘッダーファイル
 * 
 * \author 深沢拓矢
 * \date   April 2026
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================
#include "Game/State/StateBase.h"

// クラスの前方宣言 ===================================================
class Player;


// クラスの定義 ===============================================================
/**
 * @brief 基底オブジェクト
 */
class  PlayerMoveState : public StateBase<Player> {

	// クラス定数の宣言 -------------------------------------------------
public:

	// データメンバの宣言 -----------------------------------------------
private:

	// メンバ関数の宣言 -------------------------------------------------
	// コンストラクタ/デストラクタ
public:

	// コンストラクタ
	PlayerMoveState();

	// デストラクタ
	~PlayerMoveState();

	// 開始処理
	void OnEnter() override;

	// 更新処理
	void Update() override;

	// 終了処理
	void OnExit() override;

	// 操作
public:

	// 取得/設定
public:

	// 内部実装
private:

};
