/*****************************************************************//**
 * \file   PlayerAttackState.h
 * \brief  プレイヤー攻撃ステートに関するヘッダーファイル
 * 
 * \author 深沢拓矢
 * \date   May 2026
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================
#include "Game/State/StateBase.h"
// クラスの前方宣言 ===================================================
class Player;


// クラスの定義 ===============================================================
/**
 * @brief プレイヤー攻撃ステート
 */
class  PlayerAttackState : public StateBase<Player>{

	// クラス定数の宣言 -------------------------------------------------
private:

	static constexpr float ATTACK_DURATION = 0.5f;	// 攻撃の持続時間

	// データメンバの宣言 -----------------------------------------------
private:

	float m_timer;		// タイマー

	// メンバ関数の宣言 -------------------------------------------------
	// コンストラクタ/デストラクタ
public:

	// コンストラクタ
	PlayerAttackState();

	// デストラクタ
	~PlayerAttackState();

	// 操作
private:

	// 初期化処理
	void Initialize() override;

	// 開始処理
	void OnEnter() override;

	// 更新処理
	void Update() override;

	// 終了処理
	void OnExit() override;


	// 取得/設定
public:

	// 内部実装
private:

};
