// 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================

// クラスの前方宣言 ===================================================
class GameObject;


// クラスの定義 ===============================================================
/**
 * @brief 基底コンポーネント
 */
class  Component {

	// クラス定数の宣言 -------------------------------------------------
public:

	// データメンバの宣言 -----------------------------------------------
protected:

	GameObject* m_owner = nullptr;

	// メンバ関数の宣言 -------------------------------------------------
	// コンストラクタ/デストラクタ
public:

	// コンストラクタ
	Component() = default;

	// デストラクタ
	virtual ~Component() = default;

	// 操作
public:

	// 取得/設定
public:

	void SetOwner(GameObject* owner)
	{
		m_owner = owner;
	}

	// 内部実装
private:

};
