/*****************************************************************//**
 * \file   ModelRenderer.h
 * \brief  モデル描画クラスに関するヘッダーファイル
 * 
 * \author 深沢拓矢
 * \date   April 2026
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include "Component.h"

// クラスの前方宣言 ===================================================



// クラスの定義 ===============================================================
/**
 * @brief 基底オブジェクト
 */
class  ModelRenderer : public Component {

	// クラス定数の宣言 -------------------------------------------------
public:

	// データメンバの宣言 -----------------------------------------------
private:

	DirectX::Model* m_pModel = nullptr;	// モデルのポインタ
	
	// メンバ関数の宣言 -------------------------------------------------
	// コンストラクタ/デストラクタ
public:

	// コンストラクタ
	ModelRenderer();

	// デストラクタ
	~ModelRenderer();

	// 操作
public:

	// 描画
	void Draw(const DirectX::SimpleMath::Matrix& world);

	// 取得/設定
public:
	
	// モデルのセット
	void SetModel(DirectX::Model* pModel);

	// 内部実装
private:

};
