/*****************************************************************//**
 * \file   Service.h
 * \brief  サービスロケーターに格納するための基底クラス
 * 
 * \author it252184
 * \date   May 2026
 *********************************************************************/

#pragma once

/**
 * @brief 基底サービス
 */
class Service {

	// クラス定数の宣言 -------------------------------------------------
public:

	// データメンバの宣言 -----------------------------------------------
private:

	// メンバ関数の宣言 -------------------------------------------------
	// コンストラクタ/デストラクタ
public:

	// コンストラクタ
	Service() = default;

	// デストラクタ
	virtual ~Service() = default;

	// 操作
public:

	// 取得/設定
public:

	// 内部実装
private:

};
